# Sakila CodeAlong and Challenge

<img src='../Data/sakila-db-model.png'>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
# username = 'root' # default username for MySQL db is root
# password = 'YOUR_PASSWORD' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
# engine = create_engine(connection)

In [2]:
import json
with open('/Users/brend/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
login['username']

'root'

In [4]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/sakila"
engine = create_engine(connection)

In [5]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Show the Tables

In [6]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [7]:
q = ''' SELECT * FROM category;'''
pd.read_sql(q, engine)

    category_id         name         last_update
0             1       Action 2006-02-14 12:46:27
1             2    Animation 2006-02-14 12:46:27
2             3     Children 2006-02-14 12:46:27
3             4     Classics 2006-02-14 12:46:27
4             5       Comedy 2006-02-14 12:46:27
5             6  Documentary 2006-02-14 12:46:27
6             7        Drama 2006-02-14 12:46:27
7             8       Family 2006-02-14 12:46:27
8             9      Foreign 2006-02-14 12:46:27
9            10        Games 2006-02-14 12:46:27
10           11       Horror 2006-02-14 12:46:27
11           12        Music 2006-02-14 12:46:27
12           13          New 2006-02-14 12:46:27
13           14       Sci-Fi 2006-02-14 12:46:27
14           15       Sports 2006-02-14 12:46:27
15           16       Travel 2006-02-14 12:46:27

## 1. What is the average length of films by category?

In [8]:
q = '''
SELECT AVG(f.length), c.name
FROM film AS f
JOIN film_category AS fc ON f.film_id = fc.film_id
JOIN category AS c ON fc.category_id = c.category_id
GROUP BY c.name;
'''

pd.read_sql(q, engine)

    AVG(f.length)         name
0        111.6094       Action
1        111.0152    Animation
2        109.8000     Children
3        111.6667     Classics
4        115.8276       Comedy
5        108.7500  Documentary
6        120.8387        Drama
7        114.7826       Family
8        121.6986      Foreign
9        127.8361        Games
10       112.4821       Horror
11       113.6471        Music
12       111.1270          New
13       108.1967       Sci-Fi
14       128.2027       Sports
15       113.3158       Travel

## 2. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [9]:
q = '''
SELECT f.title
FROM film as f
JOIN film_category AS fc ON f.film_id = fc.film_id
JOIN category AS c ON fc.category_id = c.category_id
WHERE c.name = 'Family';
'''

pd.read_sql(q, engine)

               title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

## 3 You want to run an email marketing campaign in Canada, for which you will need the names and email addresses of all Canadian customers. Use joins to retrieve this information.

In [10]:
q = ''' 
SELECT c.first_name, c.last_name, c.email
FROM customer AS c
JOIN address AS a 
ON c.address_id = a.address_id
JOIN city ON a.city_id = city.city_id
JOIN country ON city.country_id = country.country_id
WHERE country.country = "Canada";

'''

pd.read_sql(q, engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

# The following queries use subqueries

## 4. Find the customer's first and last name where the amount paid was greater than the average payment. Make sure to only show unique results.

In [11]:
q = ''' 
SELECT DISTINCT c.first_name, c.last_name
FROM customer AS c
JOIN payment AS p ON c.customer_id = p.customer_id
WHERE p.amount > (SELECT AVG(amount) FROM payment);
'''

pd.read_sql(q, engine)

    first_name  last_name
0         MARY      SMITH
1     PATRICIA    JOHNSON
2        LINDA   WILLIAMS
3      BARBARA      JONES
4    ELIZABETH      BROWN
..         ...        ...
594   TERRENCE  GUNDERSON
595    ENRIQUE   FORSYTHE
596    FREDDIE     DUGGAN
597       WADE   DELVALLE
598     AUSTIN    CINTRON

[599 rows x 2 columns]

## 5. Find the total number of payments made by Mary Smith using subqueries.

In [12]:
q = ''' 
SELECT COUNT(*) as num_payments
FROM payment
WHERE customer_id = (SELECT customer_id FROM customer WHERE first_name = 'Mary' AND last_name = 'Smith');
'''

pd.read_sql(q, engine)

   num_payments
0            32

## 6. Use subqueries to display all actors who appear in the film Alone Trip.

In [24]:
q = '''SELECT first_name, last_name 
FROM actor
WHERE actor_id IN (SELECT actor_id
                	FROM film_actor
                	WHERE film_id IN (SELECT film_id 
                                        FROM film 
                                        WHERE title = "ALONE TRIP"));'''


pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

In [23]:
q = ''' 
SELECT actor.first_name, actor.last_name
FROM actor
WHERE actor.actor_id IN (SELECT film_actor.actor_id FROM film_actor WHERE film_id IN (SELECT film_id FROM film WHERE title = 'ALONE TRIP'));
'''

pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

Breaking the big query above into separate 3 steps

The inner subquery selects the film_id values for all films with the title "ALONE TRIP".
The middle subquery selects the actor_id values for all actors who appeared in the films selected by the inner subquery.
The outer query selects the first and last names of all actors whose actor_id values are returned by the middle subquery.

In [14]:
# Inner Query

q = '''
SELECT film_id FROM film WHERE title = 'ALONE TRIP'
'''
pd.read_sql(q, engine)

   film_id
0       17

In [21]:
# Middle Query

q = '''
SELECT actor_id FROM film_actor WHERE film_id = 17;
'''
pd.read_sql(q, engine)

   actor_id
0         3
1        12
2        13
3        82
4       100
5       160
6       167
7       187

In [22]:
# Outer Query

q = '''
SELECT first_name, last_name
FROM actor
WHERE actor_id IN (3, 12, 13, 82, 100, 160, 167, 187);
'''
pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

<img src = '../Data/Challenge.jpg'>

## 1. What are the titles, categories, and lengths of all films in the Sakila database that are longer than 120 minutes? Put the films in order by length.

In [32]:
q = '''
SELECT f.title, category.name, f.length
FROM film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category ON fc.category_id = category.category_id
WHERE f.length > 120
ORDER BY length;

'''

pd.read_sql(q, engine)

                  title       name  length
0          ARIZONA BANG   Classics     121
1         BOOGIE AMELIE      Music     121
2     BRANNIGAN SUNRISE        New     121
3      DANGEROUS UPTOWN    Foreign     121
4           HARRY IDAHO      Drama     121
..                  ...        ...     ...
452       MUSCLE BRIGHT     Travel     185
453        POND SEATTLE  Animation     185
454  SOLDIERS EVOLUTION     Sci-Fi     185
455   SWEET BROTHERHOOD     Travel     185
456        WORST BANGER     Action     185

[457 rows x 3 columns]

## 2. What are the first names, last names, and film titles of all actors named 'Penelope' in the Sakila database?

In [34]:
q = ''' 
SELECT a.first_name, a.last_name, f.title
FROM actor a
JOIN film_actor fa ON a.actor_id =  fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE a.first_name = 'Penelope';
'''

pd.read_sql(q, engine)

    first_name last_name                  title
0     PENELOPE   GUINESS       ACADEMY DINOSAUR
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS
2     PENELOPE   GUINESS            ANGELS LIFE
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS
4     PENELOPE   GUINESS          CHEAPER CLYDE
..         ...       ...                    ...
97    PENELOPE    MONROE     SPIRIT FLINTSTONES
98    PENELOPE    MONROE  TOMATOES HELLFIGHTERS
99    PENELOPE    MONROE        TOURIST PELICAN
100   PENELOPE    MONROE            TRIP NEWTON
101   PENELOPE    MONROE          WYOMING STORM

[102 rows x 3 columns]

# The following queries must use Subqueries for the statement.

## 3. Who are the actors that have acted in the film with film_id = 1

In [35]:
# Inner Query: Find actor ids of those in film_id =1
q = '''SELECT actor_id 
FROM film_actor
WHERE film_id = 1'''
pd.read_sql(q, engine)

   actor_id
0         1
1        10
2        20
3        30
4        40
5        53
6       108
7       162
8       188
9       198

In [37]:
q = ''' 
SELECT a.first_name, a.last_name
FROM actor a
WHERE actor_id IN (SELECT actor_id 
FROM film_actor
WHERE film_id = 1);

'''

pd.read_sql(q, engine)

  first_name last_name
0   PENELOPE   GUINESS
1  CHRISTIAN     GABLE
2    LUCILLE     TRACY
3     SANDRA      PECK
4     JOHNNY      CAGE
5       MENA    TEMPLE
6     WARREN     NOLTE
7      OPRAH    KILMER
8       ROCK   DUKAKIS
9       MARY    KEITEL

## 4. What are the films that are in the English Language

In [40]:
q = '''
SELECT * FROM language LIMIT 10;

'''
pd.read_sql(q, engine)

   language_id      name         last_update
0            1   English 2006-02-14 13:02:19
1            2   Italian 2006-02-14 13:02:19
2            3  Japanese 2006-02-14 13:02:19
3            4  Mandarin 2006-02-14 13:02:19
4            5    French 2006-02-14 13:02:19
5            6    German 2006-02-14 13:02:19

In [41]:
# Inner Query: Find id of english_language
q = '''
SELECT language_id
FROM language
WHERE name = "English";
'''

pd.read_sql(q, engine)

   language_id
0            1

In [42]:
q = '''
SELECT title
FROM film
WHERE language_id = (SELECT language_id
FROM language
WHERE name = "English");
'''

pd.read_sql(q, engine)

                 title
0     ACADEMY DINOSAUR
1       ACE GOLDFINGER
2     ADAPTATION HOLES
3     AFFAIR PREJUDICE
4          AFRICAN EGG
..                 ...
995     YOUNG LANGUAGE
996         YOUTH KICK
997       ZHIVAGO CORE
998  ZOOLANDER FICTION
999          ZORRO ARK

[1000 rows x 1 columns]

## 5. Who are the customers that belong to the store managed by Mike Hillyer?

In [47]:
# Inner query: What is Mike Hillyer's staff_id

q = '''
SELECT staff_id
FROM Staff
WHERE first_name = 'Mike' AND last_name = 'Hillyer';
'''

pd.read_sql(q, engine)

   staff_id
0         1

In [46]:
# Middle Query: What store_id is managed by staff_id =1
q = '''
SELECT store_id
FROM Store
WHERE manager_staff_id = 1;
'''
pd.read_sql(q, engine)

   store_id
0         1

In [48]:
# Outer Query: which customers go to store 1
q = '''
SELECT * 
FROM customer
WHERE store_id = 1;
'''

pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 12:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 12:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 12:57:20
3,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 12:57:20
4,7,1,MARIA,MILLER,MARIA.MILLER@sakilacustomer.org,11,1,2006-02-14 22:04:36,2006-02-14 12:57:20
...,...,...,...,...,...,...,...,...,...
321,594,1,EDUARDO,HIATT,EDUARDO.HIATT@sakilacustomer.org,600,1,2006-02-14 22:04:37,2006-02-14 12:57:20
322,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,1,2006-02-14 22:04:37,2006-02-14 12:57:20
323,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,1,2006-02-14 22:04:37,2006-02-14 12:57:20
324,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,1,2006-02-14 22:04:37,2006-02-14 12:57:20
325,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,1,2006-02-14 22:04:37,2006-02-14 12:57:20

In [50]:
# Combine into single query
q = ''' 
SELECT * 
FROM customer
WHERE store_id = (SELECT store_id
                    FROM Store
                    WHERE manager_staff_id = (SELECT staff_id
                            FROM Staff
                            WHERE first_name = 'Mike' AND last_name = 'Hillyer'));

'''

pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 12:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 12:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 12:57:20
3,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 12:57:20
4,7,1,MARIA,MILLER,MARIA.MILLER@sakilacustomer.org,11,1,2006-02-14 22:04:36,2006-02-14 12:57:20
...,...,...,...,...,...,...,...,...,...
321,594,1,EDUARDO,HIATT,EDUARDO.HIATT@sakilacustomer.org,600,1,2006-02-14 22:04:37,2006-02-14 12:57:20
322,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,1,2006-02-14 22:04:37,2006-02-14 12:57:20
323,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,1,2006-02-14 22:04:37,2006-02-14 12:57:20
324,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,1,2006-02-14 22:04:37,2006-02-14 12:57:20
325,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,1,2006-02-14 22:04:37,2006-02-14 12:57:20